@duganth-va Thanks for submitting this issue! However, I have not been able to duplicate the problem. Can you provide a minimal configuration that causes the problem?

I tried these versions and this config which yielded the results below:

```
Terraform v0.14.6
+ provider registry.terraform.io/hashicorp/aws v3.29.0
```

```hcl
resource "aws_sns_topic" "test" {
  name = "yaktopic"
}

resource "aws_sns_topic_policy" "test" {
  arn    = aws_sns_topic.test.arn
  policy = data.aws_iam_policy_document.test.json
}

data "aws_iam_policy_document" "test" {
  statement {
    actions = [
      "SNS:Subscribe",
    ]

    condition {
      test     = "StringEquals"
      variable = "sns:Protocol"

      values = [
        "https",
      ]
    }

    principals {
      type        = "AWS"
      identifiers = ["*"]
    }

    resources = [
      aws_sns_topic.test.arn,
    ]
  }
}
```

```console
% terraform apply

An execution plan has been generated and is shown below.
Resource actions are indicated with the following symbols:
  + create
 <= read (data resources)

Terraform will perform the following actions:

  # data.aws_iam_policy_document.test will be read during apply
  # (config refers to values not yet known)
 <= data "aws_iam_policy_document" "test"  {
      + id   = (known after apply)
      + json = (known after apply)

      + statement {
          + actions   = [
              + "SNS:Subscribe",
            ]
          + resources = [
              + (known after apply),
            ]

          + condition {
              + test     = "StringEquals"
              + values   = [
                  + "https",
                ]
              + variable = "sns:Protocol"
            }

          + principals {
              + identifiers = [
                  + "*",
                ]
              + type        = "AWS"
            }
        }
    }

  # aws_sns_topic.test will be created
  + resource "aws_sns_topic" "test" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + name   = "yaktopic"
      + policy = (known after apply)
    }

  # aws_sns_topic_policy.test will be created
  + resource "aws_sns_topic_policy" "test" {
      + arn    = (known after apply)
      + id     = (known after apply)
      + policy = (known after apply)
    }

Plan: 2 to add, 0 to change, 0 to destroy.

Do you want to perform these actions?
  Terraform will perform the actions described above.
  Only 'yes' will be accepted to approve.

  Enter a value: yes

aws_sns_topic.test: Creating...
aws_sns_topic.test: Creation complete after 1s [id=arn:aws-us-gov:sns:us-gov-west-1:123456789101:yaktopic]
data.aws_iam_policy_document.test: Reading...
data.aws_iam_policy_document.test: Read complete after 0s [id=3683377072]
aws_sns_topic_policy.test: Creating...
aws_sns_topic_policy.test: Creation complete after 1s [id=arn:aws-us-gov:sns:us-gov-west-1:123456789101:yaktopic]

Apply complete! Resources: 2 added, 0 changed, 0 destroyed.
% terraform apply
aws_sns_topic.test: Refreshing state... [id=arn:aws-us-gov:sns:us-gov-west-1:123456789101:yaktopic]
aws_sns_topic_policy.test: Refreshing state... [id=arn:aws-us-gov:sns:us-gov-west-1:123456789101:yaktopic]

Apply complete! Resources: 0 added, 0 changed, 0 destroyed.
%
```